# HostMirrored Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..HostMirrored Property
RebarUpdateCurvesData Class See Also
---
If true, then host of the rebar was mirrorred (along with the rebar) before this regeneration.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public bool HostMirrored { get; set; }
```

Visual Basic
---
```text
Public Property HostMirrored As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool HostMirrored {
	bool get ();
	void set (bool value);
}
```

# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace